{
  "plantuml.exportCurrent.title": "Exportar Diagrama Actual",
  "plantuml.exportDocument.title": "Exportar Diagramas del Archivo Actual",
  "plantuml.exportWorkspace.title": "Exportar Diagramas del Espacio de Trabajo",
  "plantuml.preview.title": "Previsualizar Diagrama Actual",
  "plantuml.URLCurrent.title": "Generar URL para el Diagrama Atual",
  "plantuml.URLDocument.title": "Generar URLs para los Diagramas del Archivo Actual",
  "plantuml.extractSource.title": "Extraer Código de PlantUML a Partir de Imagen",
  "plantuml.configuration.configTitle": "Configuración de PlantUML",
  "plantuml.configuration.exportFormat": "Formato de Exportación. Dejar en blanco para escoger formato durante cada exportación.",
  "plantuml.configuration.jar": "Ubicación alternativa de plantuml.jar. Dejar en blanco para usar el jar integrado.",
  "plantuml.configuration.diagramsRoot": "Especifica dónde están ubicados todos los archivos de diagramas (con respecto al directorio del espacio de trabajo).",
  "plantuml.configuration.fileExtensions": "Extensiones disponibles para exportación. Concretamente en la configuración del espacio de trabajo puedes añadir tus propias extensiones, por ejemplo para exportar diagramas en archivos de código fuente como \".java\".",
  "plantuml.configuration.exportSubFolder": "Exportar diagramas a un directorio con el mismo nombre que el archivo origen.",
	"plantuml.configuration.exportIncludeFolderHeirarchy": "Include folder heiracrchy between the root and the source diagram in the exported file path.",
  "plantuml.configuration.exportConcurrency": "Permite ajustar el nivel de concurrencia al exportar múltiples diagramas.",
  "plantuml.configuration.exportOutDir": "Los diagramas exportados del espacio de trabajo serán organizados en este directorio (con respecto al directorio del espacio de trabajo).",
  "plantuml.configuration.previewAutoUpdate": "Permite ajustar si la ventana de previsualización debería actualizarse automáticamente.",
  "plantuml.configuration.previewSnapIndicators": "Permite ajustar si el control para mantener el diagrama fijado a un borde (abajo/derecha/arriba/izquierda), también conocido como \"Snap\", debe mostrarse en la ventana de previsualización.",
  "plantuml.configuration.server": "Servidor de PlantUml para generar diagramas sobre la marcha. Puedes usar el servidor oficial en https://www.plantuml.com/plantuml si estás de acuerdo en compartir datos con este.",
  "plantuml.configuration.urlFormat": "Formato de URL. Dejar en blanco para elegir un formato cada vez que creas una URL.",
  "plantuml.configuration.urlResult": "Tipo de URL. URL simple o lista para su uso con MarkDown.",
  "plantuml.configuration.render": "Seleccionar método de renderizado de diagramas para exportación y previsualización.\nLocal: Renderizar diagramas localmente de la manera tradicional. Necesitas instalar JAVA y GraphViz en primer lugar.\nPlantUMLServer: Renderizar diagramas usando el servidor especificado en \"plantuml.server\". Es mucho más rapido, pero require un servidor.\nLocal es la configuraciójn por defecto.",
  "plantuml.configuration.commandArgs": "commandArgs permite añadir argumentos al comando de java, como por ejemplo \"-DPLANTUML_LIMIT_SIZE=8192\".",
  "plantuml.configuration.jarArgs": "jarArgs permite añadir argumentos a plantuml.jar, como por ejemplo \"-config plantuml.config\".",
  "plantuml.configuration.exportMapFile": "Permite ajustar si debe exportarse un archivo de mapa de imagen (.cmapx) al llevar a cabo una exportación.",
  "plantuml.configuration.java": "Localización del ejecutable de Java.",
  "plantuml.configuration.includepaths": "Especifica las rutas de búsqueda de archivos al margen del directorio del archivo renderizado y de la ruta 'diagramsRoot'.",
  "plantuml.configuration.lintDiagramNoName": "lint when diagram is unamed.",
  "plantuml.untrusted.description": "Required for loading vulnerable workspace settings"
}
