{
	"plantuml.exportCurrent.title": "Экспорт текущей диаграммы",
	"plantuml.exportDocument.title": "Экспорт диаграмм в текущем файле",
	"plantuml.exportWorkspace.title": "Экспорт диаграмм в рабочем пространстве",
	"plantuml.preview.title": "Предпросмотр текущей диаграммы",
	"plantuml.URLCurrent.title": "Сгенерировать URL для текущей диаграммы",
	"plantuml.URLDocument.title": "Сгенерировать URL пути для диаграмм в файле",
	"plantuml.extractSource.title": "Извлечь исходник PlantUML из картинки",
	"plantuml.configuration.configTitle": "Настройка PlantUML",
	"plantuml.configuration.exportFormat": "Формат экспорта. Оставьте пустым, если хотите выбирать формат при каждом экспорте.",
	"plantuml.configuration.jar": "Альтернативный путь к plantuml.jar. Оставьте пустым, если хотите использовать встроенную библиотеку.",
	"plantuml.configuration.diagramsRoot": "Указывает, где находятся все файлы диаграмм (относительный путь к рабочему пространству).",
	"plantuml.configuration.fileExtensions": "Расширения файлов, подлежащих экспортированию. Вы можете указать здесь свои собственные расширения (например, \".java\", если у вас есть возможность их обработать).",
	"plantuml.configuration.exportSubFolder": "Экспортировать диаграммы в папку с таким же именем, как и файл, из которого происходит экспорт.",
	"plantuml.configuration.exportIncludeFolderHeirarchy": "Включать в путь иерархию папок между корнем и целевым файлом при экспорте.",
	"plantuml.configuration.exportConcurrency": "Допустимое Количество потоков при экспорте более, чем 1 диаграммы.",
	"plantuml.configuration.exportOutDir": "Экспортированные из рабочего пространства диаграммы будут находиться в этой папке (относительный путь от корневой папки рабочего пространства).",
	"plantuml.configuration.previewAutoUpdate": "Указывает, обновлять, или не обновлять окно предпросмотра автоматически.",
	"plantuml.configuration.previewSnapIndicators": "Указывает, отображать, или не отображать индикаторы закрепления в области предпросмотра.",
	"plantuml.configuration.previewSwapMouseButtons": "Инвертирует функции ЛКМ и ПКМ в окне предпросмотра.",
	"plantuml.configuration.server": "Сервер PlantUML для генерации диаграмм на лету. вы можете использовать официальный сервер https://www.plantuml.com/plantuml если считаете, что отправка на него ваших данных не нанесёт вам ущерб.",
	"plantuml.configuration.urlFormat": "Формат URL. Оставьте пустым, если хотите выбирать формат каждый раз при создании URL.",
	"plantuml.configuration.urlResult": "Тип сгенерированного URL. Обычный или MarkDown.",
	"plantuml.configuration.render": "Выберите тип отрисовки диаграмм для экспорта и предпросмотра\nLocal: традиционный вариант, отрисовка произойдёт локально. Требует установки JAVA и GraphViz.\nPlantUMLServer: отрисовка диаграмм сенвером, указанным в настройке \"plantuml.server\". Это намного быстрее, но требует наличия сервера.\nLocal - опция по умолчанию.",
	"plantuml.configuration.commandArgs": "commandArgs позволяет добавить дополнительные аргументы для java. Например \"-DPLANTUML_LIMIT_SIZE=8192\".",
	"plantuml.configuration.jarArgs": "jarArgs позволяет добавлять дополнительные аргументы в для plantuml.jar. Например \"-config plantuml.config\".",
	"plantuml.configuration.exportMapFile": "Определяет, требуется ли экспортировать карту изображения (файл .cmapx) во время экспорта.",
	"plantuml.configuration.java": "Путь к исполняемому файлу Java.",
	"plantuml.configuration.includepaths": "Определяет пути для включения файлов в дополнение к корню рабочего пространства и 'diagramsRoot'.",
	"plantuml.configuration.lintDiagramNoName": "Показывать предупреждение, когда диаграмме не присвоено имя.",
	"plantuml.untrusted.description": "Необходимо для загрузки непроверенных рабочих пространств."
}